---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnZeroHeightError
source: html/5d443ed0-5da5-33ca-11d9-00aec9774621.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnZeroHeightError Property

The column can't have zero height

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnZeroHeightError { get; }
```